# Series

Series是一种一维数据结构,它类似于python中的字典,它是定长的  
Series可以进行NumPy中的各种运算  
Series最重要的功能是它能够在运算时进行自动对齐

In [1]:
import pandas as pd

In [2]:
from pandas import Series,DataFrame

In [3]:
obj=pd.Series([4,7,-5,3])

In [4]:
obj # 索引在左边,数值在右边

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

手动指定索引值

In [8]:
obj2=pd.Series([4,7,-5,3],index=['d','b','a','c'])

In [9]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

通过索引选取Series的值

In [13]:
obj2['a']

-5

In [15]:
obj2[['c','a','d']] # ['c','a','d']是一个索引列表

c    3
a   -5
d    4
dtype: int64

In [ ]:
使用NumPy中的运算方法对Series进行处理

In [16]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [17]:
obj2*2

d     8
b    14
a   -10
c     6
dtype: int64

In [18]:
obj2**2

d    16
b    49
a    25
c     9
dtype: int64

In [19]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Series可以看作是定长的字典

In [20]:
'b' in obj2

True

In [21]:
'e' in obj2

False

将字典数据用于创建Series

In [22]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [23]:
obj3=pd.Series(sdata)

In [24]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

传入排序好的字典改变另外一组字典的顺序

In [28]:
states = ['California', 'Oregon', 'Ohio', 'Texas']

In [29]:
obj4=pd.Series(sdata,index=states)

In [31]:
obj4 # 由于California在sdata中找不到对应,显示为NaN(Not a Number)
# Utah不在states中,它被移去

California        NaN
Oregon        16000.0
Ohio          35000.0
Texas         71000.0
dtype: float64

检测数据缺失的函数isnull() notnull()

In [33]:
pd.isnull(obj4)

California     True
Oregon        False
Ohio          False
Texas         False
dtype: bool

In [34]:
pd.notnull(obj4)

California    False
Oregon         True
Ohio           True
Texas          True
dtype: bool

In [35]:
obj4.isnull()

California     True
Oregon        False
Ohio          False
Texas         False
dtype: bool

Series中最重要的功能是它能够在运算时对标签进行自动对齐

In [36]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [37]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Texas         71000.0
dtype: float64

In [38]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

Series对象都有一个name属性

In [39]:
obj4.name='population'

In [40]:
obj4.index.name='state'

In [41]:
obj4

state
California        NaN
Oregon        16000.0
Ohio          35000.0
Texas         71000.0
Name: population, dtype: float64

直接通过赋值的方式修改obj的index

In [44]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [45]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [46]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

# DataFrame

可以通过含有等长列表或NumPy数组组成的字典  
而且字典中的数据会被自动对齐以及按顺序排列

In [48]:
data={'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame=pd.DataFrame(data)

In [49]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [53]:
frame.head() # 对于较大的数据会显示前五行

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

自定义序列顺序进行显示

In [54]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [55]:
frame2=pd.DataFrame(data,columns=['year','state','pop','debt'],
                   index=['one','two','three','four','five','six'])

In [56]:
frame2 # 找不到的数据会产生缺失值

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [57]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [58]:
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [59]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

通过loc属性来通过位置或名称访问数据

In [60]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

对DataFrame列进行赋值

In [61]:
frame2['debt']=16.5

In [62]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [67]:
frame2['debt']=np.arange(6.)

In [68]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

将Series对象赋值给DataFrame

In [69]:
val=pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [70]:
frame2['debt']=val

In [71]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

为不存在的列赋值会产生新列

In [74]:
frame2['eastern']=frame2.state=='Ohio'

In [75]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

用del来删除列

In [76]:
del frame2['eastern']

In [77]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

多层嵌套字典在DataFrame中会被解释为

In [78]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
....:        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [80]:
frame3=pd.DataFrame(pop)

In [81]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [82]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [83]:
pd.DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [ ]:
pdata={'oh'}